#include "StdAfx.h"
#include "bgm.h"

//==============================================================
//		コンストラクタ
//--------------------------------------------------------------
//	●引数
//		MMLfile*			MML			MMLファイルのオブジェクト
//		unsigned	int		_id			BGM番号
//		const		wchar_t	_strName[]	オブジェクト名
//	●返値
//					無し
//==============================================================
BGM::BGM(MMLfile* MML, unsigned int _id, const wchar_t _strName[]):
	TrackSet(MML, _id, false, false, _strName)
{
}

//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
BGM::~BGM(void)
{
}

//==============================================================
//		コードの取得
//--------------------------------------------------------------
//	●引数
//		MusicFile*	MUS		コードを出力する曲データファイル・オブジェクト
//	●返値
//				無し
//==============================================================
void	BGM::getAsm(MusicFile* MUS)
{
	*MUS << MUS->Header.Label.c_str() << "BGM" << m_id << ":" << endl;
	TrackSet::getAsm(MUS);
}
