#include "StdAfx.h"
#include ".\mml_Address.h"

//==============================================================
//		コンストラクタ
//--------------------------------------------------------------
//	●引数
//		unsigned	int		code
//		unsigned	int		length
//		unsigned	int		gatetime
//					bool	slur
//		const		char	_strName[]	クラスの名前
//	●返値
//				無し
//==============================================================
mml_Address::mml_Address(unsigned char _code, const char _strName[]):
	MusicEvent(_strName)
{
	iSize = 3;
	code.resize(iSize);
	code[0] = _code;
	code[1] = 0;
	code[2] = 0;
}

//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
mml_Address::~mml_Address(void)
{
}

//==============================================================
//		アドレスの設定
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
void	mml_Address::set_Address(unsigned int _addr)
{
	code[1] = ((_addr     ) & 0xFF);
	code[2] = ((_addr >> 8) & 0xFF);
}

//==============================================================
//		アドレスの取得
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
unsigned	int	mml_Address::get_Address(void)
{
	return((unsigned char)code[1] + ((unsigned char)code[2]<<8) );
}
