#include "StdAfx.h"
#include "mml_Address.h"

//==============================================================
//		コンストラクタ
//--------------------------------------------------------------
//	●引数
//		unsigned	int		code
//		unsigned	int		length
//		unsigned	int		gatetime
//					bool	slur
//		const		char	_strName[]	クラスの名前
//	●返値
//				無し
//==============================================================
mml_Address::mml_Address(unsigned char _code, const wchar_t _strName[]):
	MusicEvent(_strName)
{
	iSize = 3;
	code.resize(iSize);
	code[0] = _code;
	code[1] = 0;
	code[2] = 0;
}

mml_Address::mml_Address(unsigned char _code, unsigned char _data, const wchar_t _strName[]):
	MusicEvent(_strName)
{
	iSize = 4;
	code.resize(iSize);
	code[0] = _code;
	code[1] = _data;
	code[2] = 0;
	code[3] = 0;
}

//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
mml_Address::~mml_Address(void)
{
}

//==============================================================
//		アドレスの設定
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
void	mml_Address::set_Address(unsigned int _addr)
{
	switch(iSize){
		case(3):
			code[1] = ((_addr     ) & 0xFF);
			code[2] = ((_addr >> 8) & 0xFF);
			break;
		case(4):
			code[2] = ((_addr     ) & 0xFF);
			code[3] = ((_addr >> 8) & 0xFF);
			break;
		default:
			wcout << L"mml_Address::set_Address()関数でエラーが発生しました。" << endl;
			exit(-1);
			break;
	}
	

}

//==============================================================
//		アドレスの取得
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
/*
unsigned	int	mml_Address::get_Address(void)
{
	return((unsigned char)code[1] + ((unsigned char)code[2]<<8) );
}
*/

//==============================================================
//		idの設定
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
void	mml_Address::set_id(unsigned int _id)
{
	m_id = _id;
}

//==============================================================
//		idの取得
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
unsigned int	mml_Address::get_id(void)
{
	return(m_id);
}

