/*******************************************************************************

			NES Sound Driver & Library	(NSD.lib)	MML Compiler

	Copyright (c) 2012 A.Watanabe (S.W.), All rights reserved.
	 For conditions of distribution and use, see copyright notice in "nsc.cpp".

*******************************************************************************/

#include "StdAfx.h"
#include "mml_repeat.h"

//==============================================================
//		コンストラクタ（引数0Byte）
//--------------------------------------------------------------
//	●引数
//		const		char	_strName[]	クラスの名前
//	●返値
//				無し
//==============================================================
mml_repeat::mml_repeat(const _CHAR _strName[]):
	MusicEvent(_strName)
{
	iSize = 2;
	code.resize(iSize);
	code[0] = nsd_Repeat_A_Start;
}

//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
mml_repeat::~mml_repeat(void)
{
}

//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//		unsigned	char	count	リピート回数
//	●返値
//				無し
//==============================================================
void	mml_repeat::set_count(unsigned char count)
{
	code[1] = count;
}
