/*******************************************************************************

			NES Sound Driver & Library	(NSD.lib)	MML Compiler

	Copyright (c) 2012 A.Watanabe (S.W.), All rights reserved.
	 For conditions of distribution and use, see copyright notice in "nsc.cpp".

*******************************************************************************/

#include "StdAfx.h"
#include "MusicEvent.h"

//==============================================================
//		コンストラクタ
//--------------------------------------------------------------
//	●引数
//		const	char	_strName[]	クラスの名前
//	●返値
//				無し
//==============================================================
MusicEvent::MusicEvent(const _CHAR _strName[]):
	MusicItem(_strName)
{
}

//==============================================================
//		コンストラクタ
//--------------------------------------------------------------
//	●引数
//				int		id			ID番号
//		const	char	_strName[]	クラスの名前
//	●返値
//				無し
//==============================================================
MusicEvent::MusicEvent(unsigned int _id, const _CHAR _strName[]):
	MusicItem(_id, _strName)
{
}

//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
MusicEvent::~MusicEvent(void)
{
}
