// 静的モデル
#include "StdAfx.h"
#include "SE.h"

//==============================================================
//		コンストラクタ
//--------------------------------------------------------------
//	●引数
//		MMLfile*			MML			MMLファイルのオブジェクト
//		unsigned	int		_id			SE番号
//		const		wchar_t	_strName[]	オブジェクト名
//	●返値
//					無し
//==============================================================
SE::SE(MMLfile* MML, unsigned int _id, wchar_t _strName[]):
	TrackSet(MML, _id, false, _strName)
{
	
}

//==============================================================
//		デストラクタ
//--------------------------------------------------------------
//	●引数
//				無し
//	●返値
//				無し
//==============================================================
SE::~SE()
{
	
}
//==============================================================
//		コードの取得
//--------------------------------------------------------------
//	●引数
//		MusicFile*	MUS		コードを出力する曲データファイル・オブジェクト
//	●返値
//				無し
//==============================================================
void	SE::getAsm(MusicFile* MUS)
{
	*MUS << MUS->Header.Label.c_str() << "SE" << m_id << ":" << endl;
	TrackSet::getAsm(MUS);
}
